In [44]:
import pandas as pd
df = pd.read_csv("./py/ML/14_naive_bayes/titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [45]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'],axis="columns", inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [46]:
target = df.Survived
inputs = df.drop(['Survived'],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [47]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.drop('Sex',axis='columns',inplace=True)

In [48]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [58]:
import math
inputs.Age = inputs.Age.fillna(math.ceil(inputs.Age.mean()))
inputs.head(5)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [59]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [60]:
len(X_train)

712

In [61]:
len(X_test)

179

In [69]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [70]:
model.fit(X_train,y_train)

GaussianNB()

In [71]:
model.score(X_train, y_train)

0.7724719101123596

In [72]:
X_test[:10]

     Pclass        Age     Fare  female  male
131       3  20.000000   7.0500       0     1
225       3  22.000000   9.3500       0     1
555       1  62.000000  26.5500       0     1
711       1  29.699118  26.5500       0     1
279       3  35.000000  20.2500       1     0
472       2  33.000000  27.7500       1     0
517       3  29.699118  24.1500       0     1
336       1  29.000000  66.6000       0     1
303       2  29.699118  12.3500       1     0
105       3  28.000000   7.8958       0     1

In [73]:
y_test[:10]

131    0
225    0
555    0
711    0
279    1
472    1
517    0
336    0
303    1
105    0
Name: Survived, dtype: int64

In [74]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 1, 1, 0, 0, 1, 0])

In [75]:
data_frame = pd.read_csv("./py/ML/14_naive_bayes/spam.csv")
data_frame.head()

  Category                                            Message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...

In [78]:
data_frame.groupby('Category').describe()

         Message                                                            \
           count unique                                                top
Category
ham         4825   4516                             Sorry, I'll call later
spam         747    641  Please call our customer service representativ...


         freq
Category
ham        30
spam        4

In [81]:
data_frame['spam'] = data_frame['Category'].apply(lambda x: 1 if x=='spam' else 0)
data_frame.head()

  Category                                            Message  spam
0      ham  Go until jurong point, crazy.. Available only ...     0
1      ham                      Ok lar... Joking wif u oni...     0
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...     1
3      ham  U dun say so early hor... U c already then say...     0
4      ham  Nah I don't think he goes to usf, he lives aro...     0

In [83]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(data_frame.Message, data_frame.spam, test_size=0.25)

In [85]:
from sklearn.naive_bayes import MultinomialNB
from sklearn.pipeline import Pipeline
from sklearn.feature_extraction.text import CountVectorizer
clf = Pipeline([
    ('vectorizer', CountVectorizer()),
    ('nb', MultinomialNB())
])

In [87]:
clf.fit(X_train, y_train)

Pipeline(steps=[('vectorizer', CountVectorizer()), ('nb', MultinomialNB())])

In [88]:
clf.score(X_train,y_train)

0.9940177075855468